Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/atdf/ATSAME54N20A.atdf
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
        </register>
        <register name="BOD33" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BOD33 Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0xC" values="SUPC_BOD33__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby mode" mask="0x20"/>
          <bitfield name="RUNHIB" caption="Run in Hibernate mode" mask="0x40"/>
          <bitfield name="RUNBKUP" caption="Run in Backup mode" mask="0x80"/>
          <bitfield name="HYST" caption="Hysteresis value" mask="0xF00"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0x7000" values="SUPC_BOD33__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0xFF0000"/>
          <bitfield name="VBATLEVEL" caption="Threshold Level in battery backup sleep mode for VBAT" mask="0xFF000000"/>
        </register>
        <register name="VREG" offset="0x18" rw="RW" size="4" initval="0x00000002" caption="VREG Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="SEL" caption="Voltage Regulator Selection" mask="0x4" values="SUPC_VREG__SEL"/>
          <bitfield name="RUNBKUP" caption="Run in Backup mode" mask="0x80"/>
          <bitfield name="VSEN" caption="Voltage Scaling Enable" mask="0x10000"/>
          <bitfield name="VSPER" caption="Voltage Scaling Period" mask="0x7000000"/>
        </register>
        <register name="VREF" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREF Control">
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
          <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
          <bitfield name="TSSEL" caption="Temperature Sensor Selection" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Contrl" mask="0x80"/>
          <bitfield name="SEL" caption="Voltage Reference Selection" mask="0xF0000" values="SUPC_VREF__SEL"/>
        </register>
        <register name="BBPS" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Battery Backup Power Switch">
          <bitfield name="CONF" caption="Battery Backup Configuration" mask="0x1" values="SUPC_BBPS__CONF"/>
          <bitfield name="WAKEEN" caption="Wake Enable" mask="0x4"/>
        </register>
        <register name="BKOUT" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Backup Output Control">
          <bitfield name="ENOUT0" caption="Enable OUT0" mask="0x1"/>
          <bitfield name="ENOUT1" caption="Enable OUT1" mask="0x2"/>
          <bitfield name="CLROUT0" caption="Clear OUT0" mask="0x100"/>
          <bitfield name="CLROUT1" caption="Clear OUT1" mask="0x200"/>
          <bitfield name="SETOUT0" caption="Set OUT0" mask="0x10000"/>
          <bitfield name="SETOUT1" caption="Set OUT1" mask="0x20000"/>
          <bitfield name="RTCTGLOUT0" caption="RTC Toggle OUT0" mask="0x1000000"/>
          <bitfield name="RTCTGLOUT1" caption="RTC Toggle OUT1" mask="0x2000000"/>
        </register>
        <register name="BKIN" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Backup Input Control">
          <bitfield name="BKIN0" caption="Backup Input 0" mask="0x1"/>
          <bitfield name="BKIN1" caption="Backup Input 1" mask="0x2"/>
        </register>
      </register-group>
      <value-group name="SUPC_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
        <value name="BKUP" caption="The BOD33 puts the device in backup sleep mode" value="0x3"/>
      </value-group>
      <value-group name="SUPC_BOD33__PSEL">
        <value name="NODIV" caption="Not divided" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
      </value-group>
